import React from 'react';

const Kakao = () => {
    return (
        <svg
            id="icon_kakao"
            xmlns="http://www.w3.org/2000/svg"
            width="15.24"
            height="14"
            viewBox="0 0 18.135 16.66"
        >
            <path
                id="패스_64"
                dataName="패스 64"
                d="M322.181,2318.238c-5.008,0-9.067,3.209-9.067,7.168a7,7,0,0,0,4.3,6.1c-.19.708-.687,2.565-.786,2.962-.123.493.18.487.379.354.156-.1,2.484-1.687,3.489-2.371a11.447,11.447,0,0,0,1.683.124c5.008,0,9.067-3.209,9.067-7.168S327.189,2318.238,322.181,2318.238Z"
                transform="translate(-313.114 -2318.238)"
                fill="#381e1f"
            />
        </svg>
    );
};

export default Kakao;
