import React from 'react';

const Ad = () => {
    return (
        <svg
            xmlns="http://www.w3.org/2000/svg"
            width="39.399"
            height="39.399"
            viewBox="0 0 39.399 39.399"
        >
            <defs>
                <clipPath id="clip-path">
                    <path
                        id="패스_277"
                        data-name="패스 277"
                        d="M0,0H27.86V27.86H0Z"
                        transform="translate(0 0)"
                        fill="#999"
                    />
                </clipPath>
            </defs>
            <g
                id="마스크_그룹_28"
                data-name="마스크 그룹 28"
                transform="translate(0 19.7) rotate(-45)"
                clip-path="url(#clip-path)"
            >
                <g id="ads" transform="translate(0.001 0)">
                    <g
                        id="그룹_4056"
                        data-name="그룹 4056"
                        transform="translate(0 0)"
                    >
                        <path
                            id="패스_257"
                            data-name="패스 257"
                            d="M15.937,27.71a3.131,3.131,0,0,1-2.2-.9L.793,14.132a3.16,3.16,0,0,1-.943-2.251l.024-10a2.013,2.013,0,0,1,2-2l10-.024h.006a3.16,3.16,0,0,1,2.246.944L26.814,13.738a3.153,3.153,0,0,1-.022,4.421l-8.633,8.633a3.13,3.13,0,0,1-2.222.918ZM11.885,1.593h0l-10,.023a.266.266,0,0,0-.265.265l-.024,10a1.413,1.413,0,0,0,.42,1L14.958,25.572a1.4,1.4,0,0,0,1.971-.01l8.633-8.633a1.406,1.406,0,0,0,.009-1.971L12.888,2.013a1.41,1.41,0,0,0-1-.42ZM26.177,17.545h.012Z"
                            transform="translate(0.149 0.15)"
                            fill="#999"
                        />
                    </g>
                    <g
                        id="그룹_4057"
                        data-name="그룹 4057"
                        transform="translate(3.512 3.513)"
                    >
                        <path
                            id="패스_258"
                            data-name="패스 258"
                            d="M2.175,4.5A2.322,2.322,0,1,1,4.5,2.175,2.324,2.324,0,0,1,2.175,4.5Zm0-2.9a.58.58,0,1,0,.58.58A.581.581,0,0,0,2.175,1.595Z"
                            transform="translate(0.147 0.147)"
                            fill="#999"
                        />
                    </g>
                    <g
                        id="그룹_4058"
                        data-name="그룹 4058"
                        transform="translate(12.808 12.51)"
                    >
                        <path
                            id="패스_259"
                            data-name="패스 259"
                            d="M3.036,6.517A3.462,3.462,0,0,1,.573,5.5l-.615-.615a.869.869,0,0,1,0-1.231L3.651-.043a.871.871,0,0,1,1.232,0L5.5.572A3.481,3.481,0,0,1,5.5,5.5a3.462,3.462,0,0,1-2.462,1.02ZM1.8,4.266a1.746,1.746,0,0,0,2.463,0,1.743,1.743,0,0,0,0-2.463Z"
                            transform="translate(0.298 0.298)"
                            fill="#999"
                        />
                    </g>
                    <g
                        id="그룹_4059"
                        data-name="그룹 4059"
                        transform="translate(8.294 8.597)"
                    >
                        <path
                            id="패스_260"
                            data-name="패스 260"
                            d="M2.669,6.588A.871.871,0,0,1,2.053,5.1L4.721,2.433A.58.58,0,1,0,3.9,1.613L1.231,4.28A.871.871,0,0,1,0,3.049L2.667.381A2.321,2.321,0,1,1,5.95,3.664L3.283,6.332a.862.862,0,0,1-.614.257Z"
                            transform="translate(0.256 0.297)"
                            fill="#999"
                        />
                    </g>
                    <g
                        id="그룹_4060"
                        data-name="그룹 4060"
                        transform="translate(9.526 10.458)"
                    >
                        <path
                            id="패스_261"
                            data-name="패스 261"
                            d="M2.868,3.738a.864.864,0,0,1-.615-.255L.2,1.432A.871.871,0,1,1,1.432.2L3.484,2.253a.87.87,0,0,1-.616,1.486Z"
                            transform="translate(0.055 0.055)"
                            fill="#999"
                        />
                    </g>
                </g>
            </g>
        </svg>
    );
};

export default Ad;
